Repository: mozilla-l10n/mt-training-data
Catalog: zu/zu_pontoon.tmx
Source language: en_us
Languages: zu

source: If you submit information to Mozilla when you crash, you'll be given a crash ID which uniquely identifies your crash and lets us look at details that may help identify the cause. To find your recently submitted crash IDs, go to <strong>about:crashes</strong> in your location bar. <a href='http://support.mozilla.com/en-US/kb/Firefox+crashes#Getting_the_most_accurate_help_with_your_Firefox_crash' target='_blank'>Click for detailed instructions</a>.
zu: Uma uletha ulwazi ku-Mozilla lapha ukhresha, uzonikezwa i-crash ID nokuyiyo echazisisa kahle ukukhresha kwakho futhi yenze sikwazi ukubuka imininingwane engasisiza siqagule isizathu. Ukuze uthole ama-crash ID akho asanda kunikzwa, qonda ku <strong>about:crashes</strong> esikhaleni sakho sokufuna. <a href='http://support.mozilla.com/en-US/kb/Firefox+crashes#Getting_the_most_accurate_help_with_your_Firefox_crash' target='_blank'>Chofoza ukuze uthole imiyalelo ecacile</a>.

source: Ignore
zu: Ziba

source: Ignored Users
zu: Abasebenzisi Abazitshiwe

source: Ignore User
zu: Ziba Umsebenzisi

source: I have feedback about Firefox
zu: Nginombiko mayelana ne-Firefox

source: I have this problem, too
zu: Nami, nginale nkinga

source: Image
zu: Umfanekiso

source: Image:
zu: Umfanekiso:

source: Image Attachment
zu: Isithombe Sokuphanyekiwe

source: Images
zu: Imifanekiso

source: Image too large. Please select a smaller image file.
zu: Isithombe esingasebenzi. Uyacelwa ukuba ukhethe ifayela lesithombe esifanele.

source: Immediate Update Needed
zu: Kudingeka Ukuvuselela Ngokushesha

source: Import settings from other browsers
zu: Thutha amasethingi kusuka kwezinye iziphequluli

source: Improve our help articles
zu: Siza ukwenza ngcono ama-athikhili ethu osizo

source: Inbox
zu: Ibhokisi lemiyalezo

source: Include obsolete articles?
zu: Kubandakanywe nama-athikhili angasasetshenziswa?

source: Include this in wiki syntax with [[Image:title]]
zu: Bandakanya lokhu ku-wiki syntax ne-[[Image:title]]

source: In English
zu: NgesiNgisi

source: In order to prevent spam, we are limiting the number of answers that can be posted within a short period of time. If you want to post more please create a post on the <a href="%(url)s">contributors forum</a> requesting that you be white-listed.
zu: Ukuze uvikele i-spam, sibeka umkhawulo wenombolo yezimpendulo ezingaphostwa ngesikhathi esifushane. Uma ufuna ukuphosta okunye uyacelwa wakhe iphosti ku <a href="%(url)s">isithangami sabanegalelo</a> ucele ufakwe ohlwini lwabathembekile.

source: Insert a link...
zu: Faka ilinki...

source: Insert Link
zu: Faka ilinki

source: Insert media...
zu: Faka imidiya...

source: Insert Media
zu: Faka imidiya

source: Insert Response
zu: Faka Impendulo

source: Install and keep Firefox up to date on your iPad, iPhone or iPod Touch.
zu: Faka bese ugcina i-Firefox inezakamuva ku-iPad, iPhone noma iPod Touch yakho.

source: Install and update
zu: Faka uphinde ulungise ngokwakamuva

source: Install and Update
zu: Faka uphinde ulungise ngokwakamuva

source: Installation Issues
zu: Izinkinga Zokufakela

source: Installed plugins
zu: Amapulagi afakeliwe

source: Installed Plug-ins
zu: Fakela amapulagi

source: Install, Migrate and Update
zu: Fakela, Thutha bese Uvuselela

source: Install open apps from the Marketplace to add more fun and functionality to your device
zu: Fakela ama-app avulekile avela ku-Marketplace ukuze wengeze ubumnandi nokusebenziseka kwedivayisi yakho

source: Internet and Connections
zu: I-inthanethi Nokuxhumeka

source: Interval
zu: Isikhawu

source: Introduce yourself
zu: Zethule

source: Intro to Open Badges
zu: Isingeniso Kuma-Open Badge

source: Invalid callback function.
zu: Inkinobho yokubuyisa ucingo engasebenzi.

source: Invalid field
zu: Ifildi engasebenzi

source: Invalid ID.
zu: I-ID engasebenzi.

source: Invalid image. Please select a valid image file.
zu: Isithombe esingasebenzi. Uyacelwa ukuba ukhethe ifayela lesithombe esifanele.

source: Invalid or no image received.
zu: Umfanekiso ongasebenzi noma umfanekiso awutholakalanga.

source: Invalid search data.
zu: Idatha yokucinga engasebenzi.

source: Invalid tag entered: %s
zu: Kufakwe ithegi elingasebenzi: %s

source: Invalid username provided. Enter a new username below.
zu: Kunikezwe igama lomsebenzisi elingasebenzi. Faka igama lomsebenzisi elisha ngezansi.

source: IRC
zu: I-IRC

source: IRC nickname
zu: Isidlaliso se-IRC

source: Is approved?
zu: Ingabe kugunyaziwe?

source: Is current revision?
zu: Ingabe isibukezo samanje?

source: Issue Badges
zu: Khipha Amabheji

source: Issue digital badges to acknowledge new skills and achievements
zu: Khipha amabheji adijithali ukwazisa amakhono amasha nezimpumelelo

source: Issued on:
zu: Likhishwe ngo:

source: Issue submitted successfully
zu: Udaba lubikwe ngempumelelo

source: Italic
zu: Utsheku

source: italic text
zu: umbhalo owutsheku

source: It looks like you've bookmarked an old URL. The new URL for this page is below. You should update your bookmarks. We will forward you to the new URL in 10 seconds.
zu: Kubukeka sengathi ufake ibhukumaka ku-URL endala. I-URL entsha yaleli khasi iphansi. Kufanele uvuselele amabhukumaka akho. Sizokufowadela le URL emizuzwaneni eyi-10.

source: It seems your account has already been activated.
zu: Kubuekka sengathi i-akhawunti yakho seyiqalisiwe ukusebenza vele.

source: It's fun and addictive and the Awesome is you!
zu: Kumnandi futhi akuyekeki futhi-ke uwena Ongophambili!

source: I understand, don't show this again.
zu: Ngiyaqonda, ungaphinde ukhombise lokhu.

source: Javascript
zu: I-Javascript

source: Join our Army of Awesome
zu: Joyina Ithimba lethu Labaphambili

source: Jump to:
zu: Yeqela lapha:

source: Just edit articles in your language!
zu: Vele uhlele ukubhalwa kwama-athikhili ngolimi lwakho!

source: Just once or twice
zu: Kanye noma kabili

source: KB Dashboard
zu: Ideshibhodi ye-KB

source: KB Editor - Help to update knowledge base articles that need changes or write new articles:
zu: Umhleli we-KB - Siza ukuvuselela ulwazi lwama-athikhili ayisisekelo adinga izinguquko noma ukubhala ama-athikhili amasha:

source: KB Team
zu: Ithimba le-KB

source: Keep in touch with your contacts through email and messaging.
zu: Thintana nabezinombolo onazo nge-imeyli noma imiyalezo.

source: Keep your information safe with Firefox for Android's privacy and security settings.
zu: Gcina imininingwane yakho iphephile ngamasethingi obumfihlo nokuphepha e-Firefox ye-Android.

source: Keep your information safe with Firefox OS locks, privacy features and more.
zu: Gcina imininingwane yakho iphephile ngokhiye be-Firefox OS, amafisha akho enziwa la.

source: Keep your information safe with password and security settings
zu: Gcina imininingwane yakho iphephile ngephasiwedi namasethingi okuphepha

source: Keywords:
zu: Amagama aqavile:

source: Keywords in {locale}:
zu: Amagama aqavile ku {locale}:

source: Kitsune Contributor
zu: I-Kitsune Contributor

source: Knowledge Base
zu: Ulwazi Oluyisisekelo

source: Knowledge Base Article
zu: I-athikhili Encike Olwazini

source: Knowledge Base Dashboard
zu: Ideshibhodi Yolwazi Oluyisisekelo

source: KPI Dashboard
zu: Ideshibhodi ye-KPI

source: L10N Contributor - Help to translate Firefox Help content to your language:
zu: Olekelela ku-L10N - Siza ukuhumusha umbhalo ngolimi lwakho:

source: L10n coverage
zu: i-L10n coverage

source: L10n Coverage
zu: I-L10n Coverage

source: <label>Needs Change:</label> %(comment)s
zu: <label>Kudinga ukushintshwa:</label> %(comment)s

source: Language
zu: Ulimi

source: Languages
zu: Izilimi

source: Last 30 days
zu: Ezinsukwini ezingama-30 ezidlule

source: Last 7 days
zu: Ezinsukwini eziyisi-7 ezidlule

source: Last 90 days
zu: Izinsuku ezigama-90 ezidlule

source: Last answer date
zu: Usuku lokugcina lokuphendula

source: Last Post
zu: Iphosti Yokugcina

source: Last post date
zu: Usuku lokugcina lokuphosta

source: Last reply by
zu: Igcine ukuphendulwa ngu

source: Last reply by {user}
zu: Impendulo yokugcina yenziwe ngu {user}

source: Last updated:
zu: Kugcine ukuvuselelwa:

source: Last updated by:
zu: Igcine ukulungiswa ngu:

source: Last Week
zu: Ngesonto elidlule

source: Learn all about Thunderbird controls and functionality.
zu: Funda konke mayelana nezilawuli ze-Thunderbird nokusebenza kwayo.

source: Learn all you need to know to get Firefox for Android up and running.
zu: Funda ngakho konke odinga ukukwazi ukuze uthole i-Firefox ye-Android isebenza.

source: Learn all you need to know to get started with Firefox.
zu: Funda konke odinga ukukwazi ukuze uqale ukusebenzisa i-Firefox.

source: Learn how to add and manage contacts, as well as make one-to-one or conference calls on your Firefox OS phone.
zu: Funda ukuthi ungengeza kanjani izinombolo uphinde uzilawule, kanjalo nokuthi ufonela kanjani abantu ngabanye noma izingcongo zenkomfa efonini yakho ye-Firefox OS.

source: Learn how to change your toolbar, font sizes and browser colors
zu: Funda ukuthi ishintshwa kanjani i-toolbar, usayizi wombhalo kanye nemibala yeziphequluli

source: Learn how to configure the Internet connection, display and time on your Firefox OS device.
zu: Funda ukuthi uyixhuma kanjani i-inthanethi, veza kanye nesikhathi kudivayisi yakho ye-Firefox OS.

source: Learn how to create and share your own webpages quickly and easily.
zu: Funda ukuthi wakha kanjani uphinde wabelane ngawakho amakhasi ewebhu ngokushesha nakalula.

source: Learn how to create, assess and issue badges
zu: Funda ukuthi akhiwa, ahlolwa futhi akhishwa kanjani amabheji

source: Learn how to download Firefox on your desktop devices or move information to and from other browsers.
zu: Funda ukuthi idawunilodwa kanjani i-Firefox kumadivayisi e-desktop noma ukuthutha imininingwane iya noma isuka kwezinye iziphequluli.

source: Learn how to fix problems with Gmail, Yahoo and other email providers
zu: Funda ukuthi zilungiswa kanjani izinkinga ze-Gmail, Yahoo kanye nabanye abahlinzeki nge-imeyli

source: Learn how to import or export your information between Firefox and another browser
zu: Funda ukuthi ithuthwa noma ilethwa kanjani imininingwane phakathi kwe-Firefox nezinye iziphequluli

source: Learn how to inspect the code behind every webpage.
zu: Funda ngokuthi ihlolwa kanjani ikhodi emva kwekhasi ngalinye lewebhu.

source: Learn how to install and transfer information to Firefox for Android.
zu: Funda ukuthi ifakelwa kanjani futhi ithunyelwa kanjani imininingwane ku-Firefox ye-Android.

source: Learn how to keep your information safe and secure with Firefox's private browsing, password features and other security settings.
zu: Funda ukuthi igcinwa kanjani imininingwane yakho iphephile futhi ivikelekile ngokuphequlula okuphephile futhi okuvikelekile kwe-Firefox, amafisha e-password kanye namanye amasethingi okuvikeleka.

source: Learn how to manage your email messages
zu: Funda ukuthi ilawulwa kanjani imiyalezo yakho ye-imeyli

source: Learn how to remix web video, audio and images into mashups that you can embed on other websites.
zu: Funda ukuthi uhlela kanjani kabusha amavidiyo ewebhu, iminkenenezo kanye nemifanekiso ibe yingxube ongayifaka nakwamanye amawebhusayithi.

source: Learn how to troubleshoot issues on your Firefox OS phone.
zu: Funda ukuthi ihamba kanjani indaba ye-troubleshoot efonini yakho ye-Firefox OS.

source: Learn how to view content on another screen
zu: Funda ukuthi ibukwa kanjani imininingwane yakho kwesinye iskrini

source: Learn more about Mozilla's privacy and security practices.
zu: Fund akabanzi ngokuvikeleka kwemininingwane kwa-Mozilla kanye nezinqubo zokuphepha.

source: Learn more about Wi-Fi, Bluetooth and NFC connections.
zu: Funda kabanzi nge-Wi-Fi, i-Bluetooth kanye nokuxhumana kwe-NFC.

source: Learn new things
zu: Funda izinto ezintsha

source: Learn the basic about Open Badges
zu: Funda okuyisisekelo mayelana nama-Open Badge

source: Learn the basic functionality for your Firefox OS phone.
zu: Funda ukusebenza okuyisisekelo kocingo lwakho lwe-Firefox OS.

source: Learn the Basics: get started
zu: Funda Okuyisisekelo: qala ukwenza

source: Learn the Basics. Get Started
zu: Funda Izinto Eziyisisekelo. Qala

source: Learn tips and shortcuts to help you work faster
zu: Funda amasu nezindlela ezinqamulelayo ukuze usizakale usebenze ngokushesha kunakuqala

source: Learn to find and install open apps to add more fun and functionality to your device
zu: Funda ukuthi aholwa futhi afakelwa kanjani ama-apps avulekile ukuze wengeze ubumnandi nokusebenza kahle kwedivayisi yakho

source: Learn to set up accounts, read, send and manage emails
zu: Funda ukusetha ama-akhawunti, ukufunda, ukuthumela nokwengamela ama-imeyli

source: Leave a message for {contributor}:
zu: Shiyela u {contributor} umyalezo:

source: Leave a message for {rest} and {last}:
zu: Shiya umyalezo kwa{rest} kanye {last}:

source: Legal Notices
zu: Izaziso Zomthetho

source: Less than
zu: Kuncane kune

source: Let's make Mozilla Support speak your language!
zu: Ake senze i-Mozilla Support ikhulume ulimi lwakho!

source: Let us know which of the above you would be interested in and well help you get started. Its great to have you onboard!
zu: Sazise ukuthi yikuphi kulokhu okunenhla ongaba nentshisekelo kukho sizobe sesikusiza ukwazi ukuqala. Kumnandi kakhulu ukusebenza nawe!

source: Limited Data
zu: Idatha Enomkhawulo

source: Link target:
zu: Xhumanisa okuhlosiwe:

source: link text
zu: umbhalo welinki

source: Link text:
zu: Xhumanisa umbhalo:

source: Link to this post.
zu: Linka kule phosti.

source: Live
zu: Bukhoma

source: {l} Knowledge Base Discussions
zu: {l} Izingxoxo Zolwazi Oluyisisekelo

source: Locale
zu: Indawo

source: Locale:
zu: Okwasendaweni:

source: Locale Editors
zu: Abahleli Basendaweni

source: [{locale}] KB Team
zu: [{locale}] Ithimba le-KB

source: Locale Leaders
zu: Abaholi basendaweni

source: [{locale}] Locale Metrics
zu: [{locale}] Amamathriksi Asendaweni

source: [{locale}] Localization Team
zu: [{locale}] Ithimba Labahumushi

source: Locale Metrics
zu: Amamethriksi Asendaweni

source: {locale_name} Discussions
zu: {locale_name} Izingxoxo

source: {locale_name} Discussions | Knowledge Base
zu: {locale_name} Izingxoxo | Ulwazi Oluyisisekelo

source: [{locale}][{product}] Localization Dashboard
zu: [{locale}][{product}] Ideshibhodi Yokwasendaweni

source: Locale Reviewers
zu: Ababukezi Basendaweni

source: Locales
zu: Izindawo

source: Locales | Knowledge Base
zu: Okwendawo | Ulwazi Oluyisisekelo

source: {locale} translation:
zu: {locale} isihumusho:

source: Localization
zu: Ukwenziwa njengokwasendaweni

source: Localization Dashboard
zu: Ideshibhodi Yokufaniswa nokwasendaweni

source: Localization Metrics
zu: Ukuhunyushwa kwamamethriksi

source: Localization Percentage
zu: Iphesenti Lokwasendaweni

source: Localization status of all canned responses
zu: Isimo sokuguqulwa ngokwasendaweni kwazo zonke izimpendulo ezisethiwe

source: Localization Team
zu: Ithimba Lokuguqulwa kube njengokwasendaweni

source: Localize the document
zu: Humusha le dokhumenti

source: Locked
zu: Ikhiyiwe

source: Lock this question
zu: Khiya lo mbuzo

source: Lock this thread
zu: Khiya lolu chungechunge

source: Logged in!
zu: Usulogele ukungena!

source: Logging in...
zu: Ulogela ukungena...

source: Log in
zu: Logela ukungena

source: Login Problems?
zu: Unezinkinga zokulogela ukungena?

source: Log In / Register
zu: Logela ukungena / Rejista

source: Log in, so you can respond to your question when it is answered:
zu: Logela ukungena, ukuze uphendule umbuzo wakho uma uphendulwa:

source: Log in to an existing account
zu: Logela ukungena ku-akhawunti esikhona vele

source: Look at the top of your screen, and click the menu item called <em>Edit</em>.
zu: Buka phezulu kweskrini, bese uchofoza into ekumenyu ebizwa ngokuthi <em>Lungisa</em>.

source: Look at the top of your screen, and click the menu item called <em>Help</em>.
zu: Buka phezulu neskrini sakho, bese uchofoza kumenyu into ebizwa ngokuthi <em>Siza</em>.

source: Love Firefox and have a few moments to help?<br /> Help other Firefox users on Twitter. Good things will come to those who tweet!
zu: Uthanda i-Firefoxfuthi unesikhathi esincanyana sokusiza?<br /> Siza abanye abasebenzisi be-Firefox ku-Twitter. Izinto ezinhle ziyofika kulabo abathanda ukubhala ku-twitter!

source: Love Firefox? Love Twitter?
zu: Uthanda iFirefox? Uthanda i-Twitter?

source: Maintenance in progress
zu: Kusalungiswa njengamanje

source: Major content changes that will make older translations inaccurate
zu: Izinguquko zokubhaliwe ezinkulukazi ezingenza izinto ezihumushwe ngaphambilini zingashayi emhloleni

source: Make Firefox for Android work the way you want through customization.
zu: Yenza i-Firefox for Android ikusebenzele ngendlela oyithandayo ngokuba uzilungisele yona.

source: Make Firefox for Android yours with these customization options
zu: Yenza i-Firefox for Android ikusebenzele ngendlela oyithandayo ngokuba uzilungisele yona

source: Make Firefox yours by adding and managing the features that you want.
zu: Yenza i-Firefox ibe eyakho ngokwengeza nokulawula amafisha owafunayo.

source: Make Firefox yours through customization settings and add-ons
zu: Yenza i-Firefox ibe ngeyakho ngokuzilungisela amasethingi nokokufakela

source: Make my email public
zu: Yenza i-imeyli yami ibe ngeyomphakathi

source: Make privacy a key factor in selecting and interacting with partners.
zu: Yenza ukuvikeleka kolwazi kube yiphuzu elisemqoka lapho kukhethwa futhi kusetshenziswana nophathina.

source: Malware
zu: I-Malware

source: Manage add-ons
zu: Yengamela izifakeli zakho

source: Manage preferences and add-ons
zu: Lawula izinketho zokwengezwayo

source: Manage watch list
zu: Lawula uhla lokubukwayo

source: Many thanks for your contribution in behalf of SUMO and the happy users who get help!
zu: Sibonga kakhulu ngegalelo lakho esikhundleni se-SUMO kanye nabasebenzisi abajabule abathola usizo!

source: Many thanks for your contribution on behalf of SUMO and the happy users who are helped by your work!
zu: Egameni le-SUMO kanye nabasebenzisi abathokozile abasizakele ngenxa yomsebenzi wakho sibonga kakhulu ngegalelo lakho!

source: Mark as Ready for Localization
zu: Phawula njengosekulindele Ukuhunyushwa

source: Mark as spam
zu: Phawula njengokuyi-spam

source: Marked as spam
zu: Phawula njengokuyi-spam

source: Marked as spam by %(marked_by)s at %(marked_time)s
zu: Iphawulwe njengeyi-spam ngu-%(marked_by)s ngo %(marked_time)s

source: Marketplace
zu: I-Marketplace

source: Marketplace: Developer Support Request
zu: I-Marketplace: Isicelo Sokweseka Kumsunguli

source: Marketplace: Request a Refund
zu: I-Marketplace: Cela ukubuyiselwa imali yakho

source: Mark it as solved
zu: Yiphawule njengesonjululiwe

source: Mark read
zu: Phawula njengosekufundiwe

source: Mark Selected as Read
zu: Phawula Okukhethiwe njengokuFundiwe

source: Mark unread
zu: Phawula njengokungakafundwa

source: Matching responses
zu: Izimpendulo ezifanayo

source: media
zu: imidiya

source: Media Gallery
zu: Igalari Yemidiya

source: Media Gallery Search
zu: Ukucinga Igalari Yemidiya

source: Message:
zu: Umyalezo:

source: Message from the reviewer:
zu: Umyalezo ovela kumbukezi:

source: Message is empty
zu: Umyalezo awunalutho

source: Message is too long
zu: Umyalezo mude kakhulu

source: Message Preview:
zu: Ukubikwa Komyalezo ngaphambilini:

source: Messages
zu: Imiyalezo

source: Messages didn't add up. Try again.
zu: Imiyalezo ibingahlangani. Phinda uzame futhi.

source: Metrics
zu: Amamethriksi

source: Minor details that don't affect the instructions
zu: Imininingwane engatheni engathikamezi imiyalelo

source: mobile
zu: umakhalekhukhwini

source: Mobile device
zu: Idivayisi engumakhalekhukhwini

source: Mobile OS for smartphones
zu: I-Mobile OS yama-smartphone

source: Model not allowed.
zu: Imodeli ayivunyelwe.

source: Moderate Forum Content
zu: Lungisa Okuqukethwe Kusithangami

source: Moderate Twitter Accounts
zu: Lawula ama-akhawunti e-Twitter

source: moderator
zu: owengamele

source: Moderator
zu: Umongameli

source: Modified:
zu: Ilungiswe:

source: Modified by {name} on {datetime}
zu: Ilungiswe ngu {name} ngo {datetime}

source: Modified {datetime} by {name}
zu: Okulungisiwe {datetime} ngu {name}

source: Modified Preferences
zu: Okuthandwayo Okulungisiwe

source: Month beginning %(year)s-%(month)s-%(date)s
zu: Ukuqala kwenyanga %(year)s-%(month)s-%(date)s

source: Monthly
zu: Zinyanga zonke

source: Monthly Active Contributors
zu: Abanegalelo Abasebenza Nyangazonke

source: More system details
zu: Eminye imininingwane yohlelo

source: More than
zu: Kuningi kune

source: More than one level 2 review change drops the localization to 0%
zu: Izibukezo ezingaphezu kwesisodwa zezinga lesi-2 ezehlise ukuguqulelwa kolunye ulimi ngamaphesenti aayi-0 ku-athikhili

source: Most Recent
zu: Okusanda kwenzeka

source: Most Viewed
zu: Okubukwa Kakhulu

source: Most Visited
zu: Okuvakashelwa Njalo

source: Mozilla Persona
zu: I-Mozilla Persona

source: Mozilla Support
zu: Ukwesekwa Kwe-Mozilla

source: Mozilla Support is a community of enthusiastic volunteers and employees trying to support our users around the globe.
zu: I-Mozilla Support umphakathi wamavolontiya anogqozi nabasebenzi abazama ukusiza abasebenzisi bethu emhlabeni jikelele.

source: Mozilla Support is a community of enthusiastic volunteers and employees trying to support our users around the globe. Join us for an incredible adventure!
zu: I-Mozilla Support umphakathi wamavolontiya anogqozi nabasebenzi abazama ukweseka abasebenzisi bethu kuyo yonke le ngabadi. Hlanganyela nathi kulolu hambo oluthathekisayo!

source: Mozilla support is fully powered by our volunteer community that is helping hundreds of users everyday. This community is formed by passionate Firefox and Thunderbird users who take some of their spare time to help others. We couldn't do it without your passion and enthusiasm. Your contribution, as minor as it might seem, has tremendous value. Solving one issue in the support forums can help up to 1000 users a day!
zu: Ukweseka kwaka-Mozilla kukhuliswa umphakathi osebenza ngokuzinikela ngaphandle kwenzuzo osiza abasebenzisi abaningi nsuku zonke. Lo mphakathi wakhiwe abasebenzisi abanogqozi nge-Firefox kanye ne-Thunderbird abathatha esinye sesikhathi sabo basize abanye. Besingeke sikwazi ukukwenza ngaphandle kogqozi nelukuluku lenu. Igalelo lenu, noma ngabe libukeka lilincane kangakanani, linesandla esikhulu. Ukusombulula inkinga eyodwa ezinkundleni zokweseka kungasiza abasebenzisi abayi-1000 ngosuku!

source: Mozillians
zu: Ama-Mozillians

source: Mozillians Username
zu: Igama lomsebenzisi lama-Mozillians

source: Multiple Products
zu: Imikhiqizo Eminingi

source: Music, Photos and Video
zu: Umculo, Izithombe Namavidiyo

source: My contributions
zu: Engikufakile

source: My password isn't working.
zu: Iphasiwedi yami ayisebenzi.

source: My profile
zu: Iphrofayela yami

source: My Questions
zu: Imibuzo yami

source: {name} {version} ({id}) (Inactive)
zu: {name} {version} ({id}) (Akusebenzi)

source: Navigation
zu: Ukuthubeleza

source: Need Changes
zu: Kudinga izinguquko

source: needs attention
zu: kudinga ukubhekisiswa

source: Needs change
zu: Idinga ukushintshwa

source: Needs change:
zu: Idinga ukushintshwa:

source: Needs info
zu: Kudingeka imininingwane

source: Needs more information
zu: Kudingeka imininingwane ethe xaxa

source: Needs Update
zu: Idinga ukulungiswa

source: New announcement for {group}
zu: Isimemezelo esisha se{group}

source: New answers for question: %s
zu: Izimpendulo ezintsha zombuzo: %s

source: New Article
zu: I-athikhili Entsha

source: Newer
zu: Okusha kunokunye

source: New Message
zu: Umyalezo Omusha

source: New password
zu: Iphasiwedi entsha

source: New password:
zu: Iphasiwedi entsha:
